In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:1a_2b_3c_4d$@127.0.0.1/tutorial?host=localhost?port=3306"

# Retrieving the list of tables in the database

In [3]:
%sql Select Table_name as Tablesname FROM information_schema.tables WHERE table_schema = 'tutorial'

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
5 rows affected.

[('accounts',), ('orders',), ('regions',), ('sales_reps',), ('web_events',)]

# Starting with accounts table: 'Checking for null values'

In [4]:
%%sql 

SELECT 
    SUM(ISNULL(id)) AS id_null,
    SUM(ISNULL(name)) AS name_null,
    SUM(ISNULL(primary_contact)) AS primary_contact_null,
    SUM(ISNULL(sales_rep_id)) AS sales_rep_id_null,
    SUM(ISNULL(region_id)) AS region_id_null
FROM
    accounts

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
1 rows affected.

[(Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'), Decimal('0'))]

*No null values in the accounts table*

**So, let's split the primary _contact column in two columns : 'First Name' & 'Last Name'**

In [5]:
%%sql

/* ----  Method 1 ----  */

SELECT 
    POSITION(' ' IN primary_contact) AS position
FROM
    accounts
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[(6,), (6,), (9,), (7,), (7,), (7,), (9,), (0,), (7,), (9,)]

In [6]:
%%sql

SELECT 
    LEFT(primary_contact,
        POSITION(' ' IN primary_contact) - 1) AS First_Name,
    RIGHT(primary_contact,
        LENGTH(primary_contact) - POSITION(' ' IN primary_contact)) AS Last_Name
FROM
    accounts
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('Cammy', 'Sosnowski'),
 ('Sasha', 'Haughey'),
 ('Chanelle', 'Keach'),
 ('Elayne', 'Grunewald'),
 ('Jewell', 'Likes'),
 ('Tamara', 'Tuma'),
 ('Laurette', 'Sakai'),
 ('', ''),
 ('Wynell', 'Lepore'),
 ('Cathleen', 'Delamater')]

In [7]:
%%sql 

/* ---- Method 2 ---- */

SELECT 
    SUBSTRING_INDEX(primary_contact, ' ', 1) AS First_Name,
    SUBSTRING_INDEX(primary_contact, ' ', - 1) AS Last_Name
FROM
    accounts
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('Cammy', 'Sosnowski'),
 ('Sasha', 'Haughey'),
 ('Chanelle', 'Keach'),
 ('Elayne', 'Grunewald'),
 ('Jewell', 'Likes'),
 ('Tamara', 'Tuma'),
 ('Laurette', 'Sakai'),
 ('', ''),
 ('Wynell', 'Lepore'),
 ('Cathleen', 'Delamater')]

# Let's discover the amount of Sales Reps assigned per each region

In [8]:
%%sql

SELECT 
    r.name, COUNT(DISTINCT(sales_rep_id)) AS NO_Sales_Assigned
FROM
    accounts AS a
        LEFT OUTER JOIN
    regions AS r ON r.id = a.region_id
GROUP BY r.name
ORDER BY 2 DESC

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
4 rows affected.

[('Northeast', 21), ('Southeast', 10), ('West', 10), ('Midwest', 9)]

*Let's check if there are sales_reps not assigned to any regions*

In [9]:
%%sql

SELECT 
    SUM(ISNULL(r.name)) AS NULL_VALUES_REGION, SUM(ISNULL(a.sales_rep_id)) AS NULL_VALUS_SALES_REP
FROM
    accounts AS a
        LEFT OUTER JOIN
    regions AS r ON r.id = a.region_id

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
1 rows affected.

[(Decimal('0'), Decimal('0'))]

*All our sales reps are assigned to regions*

## Now, let's head to our sales reps table. We have had a new company domain, and we need to change all the company emails to have a suffix "@pioneers.org"

In [10]:
%%sql

SELECT 
    CONCAT(SUBSTRING_INDEX(email, '@', 1),
            '@',
            'pioneers.org') AS Email
FROM
    sales_reps
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('racine@pioneers.org',),
 ('e_esser@pioneers.org',),
 ('averette@pioneers.org',),
 ('renetta-carew@pioneers.org',),
 ('clarke@pioneers.org',),
 ('laveraoles35@pioneers.org',),
 ('felder@pioneers.org',),
 ('sh-selke8@pioneers.org',),
 ('lauria2@pioneers.org',),
 ('necole-victory@pioneers.org',)]

## Now, we want to extract our "Area Code", which is the first 3 numbers in the phone number column, and originate a separate column for the phone number

In [11]:
%%sql

SELECT 
    SUBSTRING(phone_number, 2, 3) AS Area_Code,
    SUBSTRING_INDEX(phone_number, ' ', - 1) AS Phone_Number
FROM
    sales_reps
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('841', '624-5766'),
 ('468', '366-7887'),
 ('502', '659-8223'),
 ('221', '623-6311'),
 ('450', '841-3704'),
 ('173', '886-6776'),
 ('983', '480-2956'),
 ('621', '180-7479'),
 ('661', '199-8942'),
 ('857', '252-3820')]

# Returning to the accounts table. We want to retrieve all sales_reps information associated with each account

In [12]:
%%sql

SELECT
    s.id,
    s.first_name,
    s.last_name,
    r.name AS Region,
    a.name AS Account,
    CONCAT(SUBSTRING_INDEX(email, '@', 1),
            '@',
            'pioneers.org') AS Email,
    SUBSTRING(phone_number, 2, 3) AS Area_Code,
    SUBSTRING_INDEX(phone_number, ' ', - 1) AS Phone_Number
FROM
    ((sales_reps AS s
    INNER JOIN regions AS r ON r.id = s.region_id)
    INNER JOIN accounts AS a ON s.id = a.sales_rep_id)
LIMIT 10

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[(321500.0, 'Samuel', 'Racine', 'Northeast', 'Johnson Controls', 'racine@pioneers.org', '841', '624-5766'),
 (321500.0, 'Samuel', 'Racine', 'Northeast', 'American Airlines Group', 'racine@pioneers.org', '841', '624-5766'),
 (321500.0, 'Samuel', 'Racine', 'Northeast', 'Ingram Micro', 'racine@pioneers.org', '841', '624-5766'),
 (321500.0, 'Samuel', 'Racine', 'Northeast', 'Freddie Mac', 'racine@pioneers.org', '841', '624-5766'),
 (321500.0, 'Samuel', 'Racine', 'Northeast', 'Express Scripts Holding', 'racine@pioneers.org', '841', '624-5766'),
 (321500.0, 'Samuel', 'Racine', 'Northeast', 'Walmart', 'racine@pioneers.org', '841', '624-5766'),
 (321510.0, 'Eugena', 'Esser', 'Northeast', 'Best Buy', 'e_esser@pioneers.org', '468', '366-7887'),
 (321510.0, 'Eugena', 'Esser', 'Northeast', 'Delta Air Lines', 'e_esser@pioneers.org', '468', '366-7887'),
 (321510.0, 'Eugena', 'Esser', 'Northeast', 'Energy Transfer Equity', 'e_esser@pioneers.org', '468', '366-7887'),
 (321510.0, 'Eugena', 'Esser', 'Northeast', 'PepsiCo', 'e_esser@pioneers.org', '468', '366-7887')]

# Let's figure out the number of sales_reps assigned per each account

In [13]:
%%sql

SELECT 
    DISTINCT(name), COUNT(DISTINCT (sales_rep_id)) AS sales_rep_assigned
FROM
    accounts
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('3M', 1),
 ('Abbott Laboratories', 1),
 ('AbbVie', 1),
 ('ADP', 1),
 ('Advance Auto Parts', 1),
 ('Advanced Micro Devices ', 1),
 ('AECOM', 1),
 ('AES', 1),
 ('Aetna', 1),
 ('Aflac', 1)]

*Each account has one sales rep assigned to it*

# Let's head to the orders tabl, and check how much each paper type quantity & usd_amt contribut to th total

In [14]:
%%sql

/* ---- Quantity ---- */

SELECT 
    ROUND(100 * SUM(standard_qty) / SUM(total), 2) AS standard_percent_total,
    ROUND(100 * SUM(gloss_qty) / SUM(total), 2) AS gloss_percent_total,
    ROUND(100 * SUM(poster_qty) / SUM(total), 2) AS poster_percent_total
FROM
    orders

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
1 rows affected.

[(52.73, 27.58, 19.69)]

In [15]:
%%sql

/* ---- amt_usd ---- */

SELECT 
    ROUND(100 * SUM(standard_amt_usd) / SUM(total_amt_usd), 2) AS standard_percent_total,
    ROUND(100 * SUM(gloss_amt_usd) / SUM(total_amt_usd), 2) AS gloss_percent_total,
    ROUND(100 * SUM(poster_amt_usd) / SUM(total_amt_usd), 2) AS poster_percent_total
FROM
    orders

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
1 rows affected.

[(41.8, 32.81, 25.39)]

*As we can see, in both cases, standard type has th highest contribution, followed by gloss and ending with poster*

# Let's analyze accounts based on total quantity sold, and average quantity sold. Also, total_amt_usd per account vs. average amt_usd per account and the running average

In [16]:
%%sql

SELECT 
    a.name, SUM(o.total) AS Total_Qty_Sold, ROUND(SUM(o.total_amt_usd),2) AS Total_USD
FROM
    accounts AS a
        INNER JOIN
    orders AS o ON a.id = o.account_id
GROUP BY a.name
ORDER BY 2 DESC , 3 DESC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('EOG Resources', 56410.0, 382873.3),
 ('Mosaic', 49246.0, 345618.59),
 ('IBM', 47506.0, 326819.48),
 ('Core-Mark Holding', 44750.0, 231856.98),
 ('General Dynamics', 43730.0, 300694.79),
 ('Leucadia National', 42358.0, 291047.25),
 ('Arrow Electronics', 40904.0, 281018.36),
 ('Republic Services', 40833.0, 293861.14),
 ('Sysco', 40535.0, 278575.64),
 ('Supervalu', 40412.0, 275288.3)]

*As, it's clear, the top Sales accounts 'all time' are: EOG Resources, Mosaic, and IBM*

In [17]:
%%sql

/* ----Running Total Yearly ------*/

SELECT name, Year, SUM(Total_Qty_Sold) OVER w AS Qty_running_total,
SUM(Total_USD) OVER w AS USD_running_total
FROM

(SELECT 
    a.name,
    EXTRACT(YEAR FROM o.occurred_at) AS Year,
    SUM(o.total) AS Total_Qty_Sold,
    ROUND(SUM(o.total_amt_usd), 2) AS Total_USD
FROM
    accounts AS a
        INNER JOIN
    orders AS o ON a.id = o.account_id
GROUP BY 1 , 2
ORDER BY 2 DESC , 3 DESC) SUB

WINDOW w AS (PARTITION BY name ORDER BY Year)
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('3M', 2015, 8891.0, 57050.09),
 ('3M', 2016, 19747.0, 127945.09999999999),
 ('Abbott Laboratories', 2013, 140.0, 848.84),
 ('Abbott Laboratories', 2014, 9860.0, 65451.49),
 ('Abbott Laboratories', 2015, 14707.0, 96819.92),
 ('AbbVie', 2016, 1725.0, 11243.63),
 ('ADP', 2013, 371.0, 1904.48),
 ('ADP', 2014, 11798.0, 74069.48999999999),
 ('ADP', 2015, 21602.0, 126123.13999999998),
 ('ADP', 2016, 28629.0, 163579.18)]

In [18]:
%%sql

/* ----Running Total Monthly ------*/

SELECT name, Month, SUM(Total_Qty_Sold) OVER w AS Qty_running_total,
SUM(Total_USD) OVER w AS USD_running_total
FROM

(SELECT 
    a.name,
    EXTRACT(MONTH FROM o.occurred_at) AS Month,
    SUM(o.total) AS Total_Qty_Sold,
    ROUND(SUM(o.total_amt_usd), 2) AS Total_USD
FROM
    accounts AS a
        INNER JOIN
    orders AS o ON a.id = o.account_id
GROUP BY 1 , 2
ORDER BY 2 DESC , 3 DESC) SUB

WINDOW w AS (PARTITION BY name ORDER BY Month)

LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('3M', 1, 165.0, 1020.42),
 ('3M', 2, 1568.0, 10175.52),
 ('3M', 3, 3711.0, 25021.23),
 ('3M', 4, 5158.0, 34579.119999999995),
 ('3M', 5, 7597.0, 50162.95999999999),
 ('3M', 6, 7933.0, 52174.329999999994),
 ('3M', 7, 12257.0, 79460.07999999999),
 ('3M', 8, 15577.0, 100993.25999999998),
 ('3M', 9, 17279.0, 112118.14999999998),
 ('3M', 10, 18324.0, 118655.19999999998)]

In [19]:
%%sql

/* ----Running Total Daily ------*/

SELECT name, Day, SUM(Total_Qty_Sold) OVER w AS Qty_running_total,
SUM(Total_USD) OVER w AS USD_running_total
FROM

(SELECT 
    a.name,
    EXTRACT(DAY FROM o.occurred_at) AS Day,
    SUM(o.total) AS Total_Qty_Sold,
    ROUND(SUM(o.total_amt_usd), 2) AS Total_USD
FROM
    accounts AS a
        INNER JOIN
    orders AS o ON a.id = o.account_id
GROUP BY 1 , 2
ORDER BY 2 DESC , 3 DESC) SUB

WINDOW w AS (PARTITION BY name ORDER BY Day)
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('3M', 2, 3394.0, 23090.99),
 ('3M', 3, 3559.0, 24111.41),
 ('3M', 5, 4982.0, 33401.31),
 ('3M', 6, 6233.0, 41250.89),
 ('3M', 7, 8132.0, 53424.24),
 ('3M', 8, 10849.0, 70460.75),
 ('3M', 9, 12450.0, 81161.5),
 ('3M', 23, 13946.0, 90973.86),
 ('3M', 25, 15367.0, 100333.69),
 ('3M', 27, 17310.0, 112594.3)]

# Let's check qty_sold, and usd_total on average

In [20]:
%%sql

SELECT 
    a.name,
    EXTRACT(YEAR FROM o.occurred_at) AS Date,
    AVG(o.total) AS AVG_Qty_Sold,
    ROUND(AVG(o.total_amt_usd), 2) AS AVG_USD
FROM
    accounts AS a
        INNER JOIN
    orders AS o ON a.id = o.account_id
GROUP BY 1 , 2
ORDER BY 2 DESC , 3 DESC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('UPS', 2017, 837.0, 5339.38),
 ('Devon Energy', 2017, 730.5, 4768.28),
 ('Visa', 2017, 662.5, 4613.02),
 ('W.W. Grainger', 2017, 601.5, 4192.3),
 ('Valero Energy', 2017, 592.5, 4120.8),
 ("Land O'Lakes", 2017, 494.0, 2493.23),
 ('United States Steel', 2017, 489.5, 3273.3),
 ('Stryker', 2017, 388.0, 2260.68),
 ('Anthem', 2017, 385.0, 2274.53),
 ('Genworth Financial', 2017, 312.5, 1737.62)]

*The highest on average goes to UPS followd by Devon Energy and Visa*

# Now, let's check sales_reps performance

In [21]:
%%sql

/* ------Analyzing SALES Performance Yearly ----*/ 

SELECT 
    SALES_ID, total_Qty_sold, total_usd_amt, Year
FROM
    (SELECT DISTINCT
        (a.sales_rep_id) AS SALES_ID,
            SUM(o.total) AS total_Qty_sold,
            ROUND(SUM(o.total_amt_usd),2) AS total_usd_amt,
            EXTRACT(YEAR FROM o.occurred_at) AS Year
    FROM
        accounts AS a
    INNER JOIN orders AS o ON a.id = o.account_id
    GROUP BY 1) SUB
ORDER BY 2 DESC, 3 DESC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[(321800.0, 174430.0, 1098137.72, 2013),
 (321640.0, 152638.0, 1010690.6, 2016),
 (321840.0, 150467.0, 934212.93, 2016),
 (321970.0, 134198.0, 886244.12, 2016),
 (321940.0, 122103.0, 810353.34, 2016),
 (321890.0, 120602.0, 749076.16, 2013),
 (321820.0, 119338.0, 766935.04, 2016),
 (321810.0, 115346.0, 650393.52, 2016),
 (321960.0, 115156.0, 655954.74, 2016),
 (321830.0, 112684.0, 702697.29, 2013)]

*Analyzing year 2016*

In [22]:
%%sql

/* ------Analyzing SALES Performance Yearly ----*/ 

SELECT 
    SALES_ID, total_Qty_sold, total_usd_amt, Year
FROM
    (SELECT DISTINCT
        (a.sales_rep_id) AS SALES_ID,
            SUM(o.total) AS total_Qty_sold,
            ROUND(SUM(o.total_amt_usd),2) AS total_usd_amt,
            EXTRACT(YEAR FROM o.occurred_at) AS Year
    FROM
        accounts AS a
    INNER JOIN orders AS o ON a.id = o.account_id
    GROUP BY 1) SUB
    WHERE Year = 2016
ORDER BY 2 DESC, 3 DESC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[(321640.0, 152638.0, 1010690.6, 2016),
 (321840.0, 150467.0, 934212.93, 2016),
 (321970.0, 134198.0, 886244.12, 2016),
 (321940.0, 122103.0, 810353.34, 2016),
 (321820.0, 119338.0, 766935.04, 2016),
 (321810.0, 115346.0, 650393.52, 2016),
 (321960.0, 115156.0, 655954.74, 2016),
 (321910.0, 102351.0, 675917.64, 2016),
 (321690.0, 88533.0, 550973.02, 2016),
 (321980.0, 83589.0, 488448.47, 2016)]

# Let's head to web_events table to analyz the partition of each channel regarding sales_reps, sales_qty, sales_usd

In [23]:
%%sql

/* ---- Channel Most Frequently Occuring ----*/

SELECT 
    channel, COUNT(*) AS CHANNEL_FREQ
FROM
    web_events
GROUP BY channel
ORDER BY 2 DESC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('direct', 3979),
 ('organic', 155),
 ('facebook', 145),
 ('adwords', 126),
 ('banner', 72),
 ('twitter', 64),
 ('93.0', 6),
 ('76.0', 5),
 ('139.0', 5),
 ('524.0', 5)]

*Direct has the highest percent of occurence*

In [24]:
%%sql

/*-------Sales Reps assigned per each channel -------*/


SELECT 
    w.channel, COUNT(DISTINCT (a.sales_rep_id)) AS NO_SALES_ASSIGNED
FROM
    web_events AS w
        INNER JOIN
    accounts AS a ON a.id = w.account_id
GROUP BY 1
ORDER BY 2 DESC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('direct', 50),
 ('adwords', 28),
 ('organic', 28),
 ('facebook', 27),
 ('banner', 25),
 ('twitter', 24),
 ('76.0', 5),
 ('139.0', 5),
 ('901.0', 5),
 ('93.0', 5)]

In [25]:
%%sql

/*----------Channel Profit ----------*/

SELECT 
    w.channel, SUM(o.total) AS Total_QTY, SUM(o.total_amt_usd) AS Total_USD
FROM
    ((web_events AS w
        INNER JOIN
    accounts AS a ON a.id = w.account_id)
    INNER JOIN orders AS o
    ON a.id = o.account_id)
GROUP BY 1
ORDER BY 2 DESC,3 DESC
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('direct', 78962237.0, 496604702.26998794),
 ('organic', 3288637.0, 20522719.96999992),
 ('facebook', 3104350.0, 19594322.96999992),
 ('adwords', 2498359.0, 15906795.69999995),
 ('banner', 1465855.0, 9276699.989999993),
 ('twitter', 1150299.0, 7163836.01),
 ('822.0', 135786.0, 878360.3099999997),
 ('173.0', 133178.0, 870773.0799999994),
 ('93.0', 126926.0, 697088.6700000012),
 ('74.0', 106015.0, 675647.1099999995)]

*The most profitable channel is direct followed by organic and facebook
So, lt's analyze our top 6 channels only*

In [26]:
%%sql

/*----------Top 6 Channels only ---------------*/


SELECT 
    w.channel, SUM(o.total) AS Total_QTY, SUM(o.total_amt_usd) AS Total_USD
FROM
    ((web_events AS w
        INNER JOIN
    accounts AS a ON a.id = w.account_id)
    INNER JOIN orders AS o
    ON a.id = o.account_id)
GROUP BY 1
HAVING UPPER(channel) IN ('DIRECT','ORGANIC','FACEBOOK','ADWORDS','BANNER','TWITTER')
ORDER BY 2 DESC,3 DESC

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
6 rows affected.

[('direct', 78962237.0, 496604702.26998794),
 ('organic', 3288637.0, 20522719.96999992),
 ('facebook', 3104350.0, 19594322.96999992),
 ('adwords', 2498359.0, 15906795.69999995),
 ('banner', 1465855.0, 9276699.989999993),
 ('twitter', 1150299.0, 7163836.01)]

In [27]:
%%sql

/*------channel running total & Net Profit ----------*/



SELECT channel, Year, QTY_running_total, USD_running_total, LAG_USD_running_total, 
       LEAD_USD_running_total, ROUND((LEAD_USD_running_total - LAG_USD_running_total),2) AS Net_Profit
FROM

(SELECT  channel, Year, QTY_running_total, USD_running_total, 
         COALESCE(LAG_USD_running_total,0) AS LAG_USD_running_total , 
         COALESCE(LEAD_running_total,0) AS LEAD_USD_running_total
FROM
 
(SELECT 
    channel, Year, SUM(Total_QTY) OVER w AS QTY_running_total,
    SUM(Total_USD) OVER w AS USD_running_total,
    LAG(Total_USD) OVER w AS LAG_USD_running_total,
    LEAD(Total_USD) OVER w AS LEAD_running_total
 
FROM
 
    (SELECT 
        w.channel,
            SUM(o.total) AS Total_QTY,
            SUM(o.total_amt_usd) AS Total_USD,
            EXTRACT(YEAR FROM w.occurred_at) AS Year
     
    FROM
     
        ((web_events AS w
    INNER JOIN accounts AS a ON a.id = w.account_id)
    INNER JOIN orders AS o ON a.id = o.account_id)
    GROUP BY 1,4
    HAVING UPPER(channel) IN ('DIRECT' , 'ORGANIC', 'FACEBOOK', 'ADWORDS', 'BANNER', 'TWITTER')) SUB
WINDOW w AS (PARTITION BY channel ORDER BY Year)) SUB) SUB1

LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[('adwords', 2013, 87749.0, 572111.4500000002, 0.0, 5119315.180000003, 5119315.18),
 ('adwords', 2014, 880747.0, 5691426.630000004, 572111.4500000002, 4209405.930000002, 3637294.48),
 ('adwords', 2015, 1569509.0, 9900832.560000006, 5119315.180000003, 5995284.370000002, 875969.19),
 ('adwords', 2016, 2496685.0, 15896116.930000007, 4209405.930000002, 10678.769999999999, -4198727.16),
 ('adwords', 2017, 2498359.0, 15906795.700000007, 5995284.370000002, 0.0, -5995284.37),
 ('banner', 2013, 99529.0, 644096.8000000002, 0.0, 3099821.520000002, 3099821.52),
 ('banner', 2014, 592497.0, 3743918.320000002, 644096.8000000002, 2393061.460000001, 1748964.66),
 ('banner', 2015, 970252.0, 6136979.780000003, 3099821.520000002, 3139720.2099999962, 39898.69),
 ('banner', 2016, 1465855.0, 9276699.989999998, 2393061.460000001, 0.0, -2393061.46),
 ('direct', 2013, 1491837.0, 9257599.409999998, 0.0, 111117318.32000007, 111117318.32)]

# Finally, it seems that the date column in web_events table needs some work. So, let's reformat the date column in much proper way "dd-mm-yyyy"

In [28]:
%%sql

/*-----------Date Reformatted ----------*/

SELECT 
    id,
    account_id,
    channel,
    CONCAT( SUBSTRING(SUBSTRING_INDEX(occurred_at, '-', -2),4,2),
            '-',
            RIGHT(SUBSTRING_INDEX(occurred_at, '-', 2),2),
            '-',
            LEFT(occurred_at, 4)) AS Date
FROM
    web_events
LIMIT 10;

 * mysql+pymysql://root:***@127.0.0.1/tutorial?host=localhost
10 rows affected.

[(1.0, 1001.0, 'direct', '06-10-2015'),
 (3304.0, 3531.0, 'direct', '02-07-2015'),
 (3.0, 1001.0, 'direct', '04-12-2015'),
 (4.0, 1001.0, 'direct', '02-01-2016'),
 (3306.0, 3531.0, '228.0', '01-02-2016'),
 (3307.0, 3531.0, 'direct', '02-03-2016'),
 (7.0, 1001.0, 'direct', '01-04-2016'),
 (3308.0, 3531.0, 'direct', '28-10-2015'),
 (9.0, 1001.0, 'direct', '31-05-2016'),
 (10.0, 1001.0, 'direct', '30-06-2016')]